erpdev.СХК_Расширение/src/Documents/ПересчетТоваров/ПересчетТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="852cd565-1094-4515-9352-2ed625a00830">
  <name>ПересчетТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="8eab6973-9074-4141-ad3b-d91d6c861d9f">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ee420e54-7251-4a5d-9d47-2d68d89d552c">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpdev.СХК_Расширение/src/AccumulationRegisters/СХК_ТоварыНаСкладе/СХК_ТоварыНаСкладе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СХК_ТоварыНаСкладе</name>
  <resources>
    <name>ВНаличии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.СХК_СкладЯчейки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

erpdev.СХК_Расширение/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="57507687-e857-4627-84a6-131b6dc5555a">
    <name>Товар</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e654eb8f-cadf-4ea9-b106-6855158dcb94">
    <name>Работа</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="898c017b-174f-4670-8146-5c6e75af51c1">
    <name>МногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d257be95-baab-4cf8-b5ae-541216c91b07">
    <name>Услуга</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

erpdev.СХК_Расширение/src/Documents/ПересчетТоваров/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//++shishkin@syspod.ru #87939 
	// СтандартныеПодсистемы.РаботаСФайлами
	ПараметрыГиперссылки = РаботаСФайлами.ГиперссылкаФайлов();
	ПараметрыГиперссылки.Размещение = "КоманднаяПанель";
	РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыГиперссылки);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	//--shishkin@syspod.ru #87939
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПриОткрытииПосле(Отказ)
	//++shishkin@syspod.ru #87939
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	//--shishkin@syspod.ru #87939
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	//++shishkin@syspod.ru #87939
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	//--shishkin@syspod.ru #87939
КонецПроцедуры 

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)
	//++shishkin@syspod.ru #87939
	РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);
	//--shishkin@syspod.ru #87939
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	//++shishkin@syspod.ru #87939
	РаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка);
	//--shishkin@syspod.ru #87939
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	//++shishkin@syspod.ru #87939
	РаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка);
	//--shishkin@syspod.ru #87939
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)
	//++shishkin@syspod.ru #87939
	РаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	//--shishkin@syspod.ru #87939
КонецПроцедуры
///////////////////////////заполнение фактического количеста по результатам перемещений в день инвентаризации
&НаКлиенте
Процедура Расш1_ЗаполнитьПоТСДПосле(Команда)
	ЗаполнитьПоТСД();
	ОбновитьКоличество();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКоличество()
	Для Каждого стр из Объект.Товары Цикл
	ТекущаяСтрока = стр;
	
	СтруктураДействий = Новый Структура;
	
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковокФакт(СтруктураДействий);
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);			
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьПоТСД()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	СХК_ТоварыНаСкладеОстатки.Серия КАК Серия,
				   |	СХК_ТоварыНаСкладеОстатки.Номенклатура КАК Номенклатура,
				   |	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток КАК Количество
				   |ИЗ
				   |	РегистрНакопления.СХК_ТоварыНаСкладе.Остатки(
				   |			&ДатаОкончания,
				   |			Ячейка <> &Ячейка
				   |				) КАК СХК_ТоварыНаСкладеОстатки
				   |ГДЕ
				   |	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток > 0 ";
	//Запрос.УстановитьПараметр("Дата",Дата("30.01.2026 20:00:00"));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("Ячейка", Справочники.СХК_СкладЯчейки.НайтиПоКоду("000000372"));

	Рез = Запрос.Выполнить().Выбрать();

	Пока Рез.Следующий() Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", Рез.Номенклатура);
		Отбор.Вставить("Серия", Справочники.СерииНоменклатуры.НайтиПоНаименованию(Рез.Серия));

		Строки = Объект.Товары.НайтиСтроки(Отбор);

		Если Строки.Количество() = 1 Тогда
			Строки[0].КоличествоФакт = Рез.Количество;
			Строки[0].КоличествоУпаковокФакт = Рез.Количество;

		ИначеЕсли Строки.Количество() = 0 Тогда
			Т = Объект.Товары.Добавить();
			Т.Количество = 0;
			Т.КоличествоФакт = Рез.Количество;
			Т.КоличествоУпаковок = 0;
			Т.КоличествоУпаковокФакт = Рез.Количество;
			Т.Номенклатура = Рез.Номенклатура;
			Т.Упаковка = Рез.Номенклатура.ЕдиницаИзмерения;
			Т.Серия = Справочники.СерииНоменклатуры.НайтиПоНаименованию(Рез.Серия);
			Т.СтатусУказанияСерий = 10;
			Т.ИзлишекПорча = Ложь;
			Т.ХарактеристикиИспользуются = Ложь;
			Т.ТипНоменклатуры	= Перечисления.ТипыНоменклатуры.Товар;
			Т.Артикул = Рез.Номенклатура.Артикул;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
